---------------------------------------------------------------------------
--游戏消息( 四人牛牛 )
---------------------------------------------------------------------------
---------------------------------------------------------------------------
--全局数据( 四人牛牛 )
---------------------------------------------------------------------------
g_Global.Game.Srnn = {}

--配置定义
g_Global.Game.Srnn.config = {
	timeWait     =3,          --//等待3秒
}

--消息定义
g_Global.Game.Srnn.msgPkSrnn = {
	-------------------------------------------------------
	--房间登陆
	-------------------------------------------------------
	MDM_GR_LOGON				= 1,		--房间登录
	--//////////////////////////////////////////////////////////////////////////
	--// 客户端命令
	CMD_SC_WaitReady_P			=1,			--//准备等待（3秒）
	CMD_SC_GameStart_P			=2,			--//游戏开始
	CMD_SC_ChipStart_P			=3,			--//下注开始（下注开始）
	CMD_SC_UserChip_P			=4,			--//玩家下注
	CMD_SC_DispatchCard_P		=5,			--//系统发牌（凑牌开始）
	CMD_SC_UserOpenCard_P		=6,			--//玩家凑牌
	CMD_SC_SysOpenCard_P		=7,			--//系统开牌（开牌开始）
	CMD_SC_EndScore_P			=8,			--//游戏结算（结算开始）
	CMD_SC_UserRob_P			=9,			--//玩家抢庄
	CMD_SC_NotifyUserRob_P		=10,		--//通知玩家抢庄
}



