
-----------------------------------------------------------
--用户信息 (自己的全局信息) 
g_GlobalUserData = {
	--基本信息
	dwUserID = 0,			--玩家ID
	dwGameID = 0,			--游戏ID
	lExp = 0,				--游戏经验
	szAccounts = "",		--登录帐号
	szNickName = "",		--用户昵称
	szPassword = "",		--登录密码
	wTableID = -1, 			--桌子位置 
	wChairID = -1,			--椅子位置 
	bySex = 0, 				--用户性别
	wFaceID = 0,			--头像ID

	--玩家分数
	lScore = 0,				--游戏分数
	lGold = 0, 				--玩家金币
	lBankGold = 0, 			--银行金币

	--会员
	VipLv = 0, 				--会员等级
	VipOverTime = "" 		--到期时间
}

-----------------------------------------------------------
--全局设置
g_GlobalConfig = {
	--服务器信息
	nVersion = 0,					--大厅版本
	nHallPort = 0,					--大厅端口
	lHallKey = 0,					--大厅key
	szSrvIP = "120.27.145.200",		--服务器IP
}

-----------------------------------------------------------
--全局变量 
g_Global = {
	Hall = {},		--大厅
	Room = {},		--房间
	Game = {},		--游戏
}

-----------------------------------------------------------
--游戏种类列表 (class GameKind)
ListGameKind = {}

-----------------------------------------------------------
--游戏房间列表 (class GameRoom)
ListGameRoom = {}

-----------------------------------------------------------
--房间玩家列表 (class UserData)
ListRoomUser = {}

-----------------------------------------------------------
--桌子玩家列表 (class UserData)
ListTableUser = {}

-----------------------------------------------------------
